In [1]:
%pip install pandas

Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [15]:
# Create pandas data table
import pandas as pd
data= pd.DataFrame({
            "name":["Suryansh","Ganesh","Aakash",None]  ,
            "age":  [20,21,26,None]  ,
            "state": ["MP","MP","MP",None]  ,
            "semester":["3rd","6th","Passout",None]  ,
})
print(data)

       name   age state semester
0  Suryansh  20.0    MP      3rd
1    Ganesh  21.0    MP      6th
2    Aakash  26.0    MP  Passout
3      None   NaN  None     None

In [3]:

#getting column "name"
data["name"] # select name from data;

0    Suryansh
1      Ganesh
2      Aakash
Name: name, dtype: object

In [4]:
#Getting column "Age"
data["age"] # select age form data;

0    20
1    21
2    26
Name: age, dtype: int64

In [5]:
#Getting column "Semester"
data["semester"] # select semester from data;

0        3rd
1        6th
2    Passout
Name: semester, dtype: object

In [6]:
#Getting Maximum value form column "Age" in Data table "data"
data["age"].max()  #select max(age) from data;

np.int64(26)

In [13]:
#Getting Minimum value form column "Age" in Data table "data"
print(data["age"].min()) #select min(age) from data;

20

In [8]:
data["age"].mean() # select avg(age) from data;

np.float64(22.333333333333332)

In [9]:
data["age"].count() # select count(age) from data;

np.int64(3)

In [10]:
data["age"].sum() # select sum(age) from data;

np.int64(67)

In [11]:
data["age"].std() # select stdev(age) from data;

np.float64(3.2145502536643185)

In [16]:
# To Detect the null in Dataframe So that we can handle Missing Value that means we need clean our data
data.isnull() # select * from data where isnull(name) # like

    name    age  state  semester
0  False  False  False     False
1  False  False  False     False
2  False  False  False     False
3   True   True   True      True

In [17]:
# to get total number of Mising Value 
data.isnull().sum() # select count(*) from data where isnull(name) # like

name        1
age         1
state       1
semester    1
dtype: int64